/************************************************************************/
/* @file:	executor.h                                                  */
/* @brief:	线程执行体                                                  */
/* @author:	Zhang Keliang                                               */
/* @email:	klzhang@fudan.edu.cn                                        */
/* @date:	2017-08-14                                                  */
/* @last:	2017-08-14                                                  */
/*                                                                      */
/* 提供一个通用的线程执行体，某个线程只需要执行该执行体的run接口即可    */
/*                                                                      */
/************************************************************************/

#ifndef __WARLORD_COMMON_EXECUTOR_H__
#define __WARLORD_COMMON_EXECUTOR_H__

#include "public_include.h"

class Executor
{
public:
	//-------------------------------------------------------------------------
	// 构造函数和析构函数
	//-------------------------------------------------------------------------
	Executor();
	virtual ~Executor();

public:
	//-------------------------------------------------------------------------
	// 执行和结束
	//-------------------------------------------------------------------------
	virtual void	Run() = 0;
	virtual void	OnShutDown();
};

#endif	/* __WARLORD_COMMON_EXECUTOR_H__ */
