/************************************************************************/
/* @file:	thread_mgr.h                                                */
/* @brief:	线程管理器                                                  */
/* @author:	Zhang Keliang                                               */
/* @email:	klzhang@fudan.edu.cn                                        */
/* @date:	2017-08-14                                                  */
/* @last:	2017-08-14                                                  */
/*                                                                      */
/*                                                                      */
/************************************************************************/

#ifndef __WARLORD_COMMON_THREAD_MGR_H__
#define __WARLORD_COMMON_THREAD_MGR_H__

#include "public_include.h"

class Thread;

class ThreadMgr
{
public:
	//-------------------------------------------------------------------------
	// 构造函数和析构函数
	//-------------------------------------------------------------------------
	ThreadMgr();
	~ThreadMgr();

public:
	//-------------------------------------------------------------------------
	// 初始化、销毁
	//-------------------------------------------------------------------------
	bool			Init();
	void			Destroy();
	void			ShutDown();
	
public:
	//-------------------------------------------------------------------------
	// 创建、停止等线程操作
	//-------------------------------------------------------------------------
	int64_t			CreateThread(Executor* _executor);
	void			StopThread(int64_t _id);
	
private:
	//-------------------------------------------------------------------------
	// 成员变量
	//-------------------------------------------------------------------------
	pthread_mutex_t				lock_;
	int64_t						id_;
	std::<int64_t, Thread*>		threads_;
};

#endif /* __WARLORD_COMMON_THREAD_MGR_H__ */
