/************************************************************************/
/* @file:	skill.h                                                     */
/* @brief:	战斗技能                                                    */
/* @author:	Zhang Keliang                                               */
/* @email:	klzhang@fudan.edu.cn                                        */
/* @date:	2017-07-21                                                  */
/* @last:	2017-07-21                                                  */
/*                                                                      */
/*                                                                      */
/************************************************************************/

#ifndef __WARLORD_GAMESVR_SKILL_H__
#define __WARLORD_GAMESVR_SKILL_H__

#include "common.h"

class Skill
{
public:
	//-------------------------------------------------------------------------
	// 构造函数和析构函数
	//-------------------------------------------------------------------------
	Skill();
	~Skill();
	
public:
	//-------------------------------------------------------------------------
	// 初始化和销毁
	//-------------------------------------------------------------------------
	bool	Init(const int64_t _skill_id);
	bool	Init(const MemSkillEntry* _skill_entry);
	void	Destroy();
	
public:
	//-------------------------------------------------------------------------
	// 成员变量的 get/set 函数
	//-------------------------------------------------------------------------
	const MemSkillEntry*				get_skill_entry()	{ return skill_entry_; }
	int64_t								get_skill_id()		{ return skill_entry_ ? skill_entry_->id : 0; }
private:
	//-------------------------------------------------------------------------
	// 成员变量
	//-------------------------------------------------------------------------
	const MemSkillEntry*				skill_entry_;
};

#endif /* __WARLORD_GAMESVR_SKILL_H__ */
