#ifndef __SERVER_H__
#define __SERVER_H__

#define SERVER_PORT "1037"  // the port users will be connecting to
#define BACKLOG 10          // how many pending connecting queue will hold

#include "common.h"

class Server
{
public:
	//-------------------------------------------------------------------------
	// 构造函数和析构函数
	//-------------------------------------------------------------------------
 	Server();
 	~Server();
	
public:
	//-------------------------------------------------------------------------
	// 初始化和销毁
	//-------------------------------------------------------------------------
	bool Init();
	void Destroy();
	
public:
	//-------------------------------------------------------------------------
	// 每帧更新
	//-------------------------------------------------------------------------
	void Update();	
	void UpdateTime();
};

#endif /* __SERVER_H__ */
